In [1]:
import numpy as np

In [2]:
arr1 = np.arange(10)
arr1

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [3]:
np.sqrt(arr1)

array([0.        , 1.        , 1.41421356, 1.73205081, 2.        ,
       2.23606798, 2.44948974, 2.64575131, 2.82842712, 3.        ])

In [4]:
np.square(arr1)

array([ 0,  1,  4,  9, 16, 25, 36, 49, 64, 81])

In [5]:
np.exp(arr1)

array([1.00000000e+00, 2.71828183e+00, 7.38905610e+00, 2.00855369e+01,
       5.45981500e+01, 1.48413159e+02, 4.03428793e+02, 1.09663316e+03,
       2.98095799e+03, 8.10308393e+03])

In [6]:
np.sin(arr1)

array([ 0.        ,  0.84147098,  0.90929743,  0.14112001, -0.7568025 ,
       -0.95892427, -0.2794155 ,  0.6569866 ,  0.98935825,  0.41211849])

In [7]:
np.cos(arr1)

array([ 1.        ,  0.54030231, -0.41614684, -0.9899925 , -0.65364362,
        0.28366219,  0.96017029,  0.75390225, -0.14550003, -0.91113026])

In [8]:
arr2 = np.array([4,2,1,7,8])
arr3 = np.array([5,1,4,6,9])

In [9]:
np.maximum(arr2, arr3)

array([5, 2, 4, 7, 9])

In [11]:
arr4 = np.array([32.5233, 74.437, 914.888, 123.657])

In [12]:
np.modf(arr4)

(array([0.5233, 0.437 , 0.888 , 0.657 ]), array([ 32.,  74., 914., 123.]))

In [13]:
arr5 = np.arange(8)
arr5

array([0, 1, 2, 3, 4, 5, 6, 7])

In [16]:
arr6 = arr5.reshape(4,2)
arr6

array([[0, 1],
       [2, 3],
       [4, 5],
       [6, 7]])

In [17]:
arr6.T

array([[0, 2, 4, 6],
       [1, 3, 5, 7]])

In [18]:
xarr = np.array([1.1,   1.2,  1.3,   1.4])
yarr = np.array([2.1,   2.2,  2.3,   2.4])
cond = np.array([False, True, False, True])

In [19]:
result = [x if c else y for x, y, c in zip(xarr, yarr, cond)]
result

[2.1, 1.2, 2.3, 1.4]

In [20]:
result2 = np.where(cond, xarr, yarr)
result2

array([2.1, 1.2, 2.3, 1.4])

In [21]:
np.random.seed(12345)
arr7 = np.random.randn(4,4)
arr7

array([[-0.20470766,  0.47894334, -0.51943872, -0.5557303 ],
       [ 1.96578057,  1.39340583,  0.09290788,  0.28174615],
       [ 0.76902257,  1.24643474,  1.00718936, -1.29622111],
       [ 0.27499163,  0.22891288,  1.35291684,  0.88642934]])

In [22]:
np.where(arr7 > 0, arr7, 0)

array([[0.        , 0.47894334, 0.        , 0.        ],
       [1.96578057, 1.39340583, 0.09290788, 0.28174615],
       [0.76902257, 1.24643474, 1.00718936, 0.        ],
       [0.27499163, 0.22891288, 1.35291684, 0.88642934]])

In [23]:
np.where(arr7 > 0, 5, -5)

array([[-5,  5, -5, -5],
       [ 5,  5,  5,  5],
       [ 5,  5,  5, -5],
       [ 5,  5,  5,  5]])

In [27]:
arr8 = np.random.randn(4,5)
arr8

array([[ 2.16946144, -0.1149282 ,  2.00369736,  0.02961015,  0.79525316],
       [ 0.11810975, -0.74853155,  0.58496974,  0.15267657, -1.56565729],
       [-0.56254019, -0.03266414, -0.9290062 , -0.48257265, -0.03626385],
       [ 1.09539006,  0.98092848, -0.58948769,  1.58170009, -0.52873483]])

In [29]:
arr8.mean(), arr8.sum()

(0.19607051119998253, 3.9214102239996507)

In [30]:
arr8.mean(axis=0)

array([ 0.70510527,  0.02120115,  0.2675433 ,  0.32035354, -0.3338507 ])

In [31]:
arr8.sum(axis=1)

array([ 4.8830939 , -1.45843278, -2.04304702,  2.53979612])

In [33]:
arr8.std(axis=1)

array([0.95905763, 0.7701463 , 0.34057426, 0.89451871])

In [34]:
arr9 = np.arange(8)
arr9

array([0, 1, 2, 3, 4, 5, 6, 7])

In [35]:
arr9.cumsum()

array([ 0,  1,  3,  6, 10, 15, 21, 28])

In [36]:
arr10 = np.array([[0,1,2],
                 [3,4,5],
                 [6,7,8]])

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [37]:
arr10.cumsum(axis=0)

array([[ 0,  1,  2],
       [ 3,  5,  7],
       [ 9, 12, 15]])

In [38]:
arr10.cumprod(axis=1)

array([[  0,   0,   0],
       [  3,  12,  60],
       [  6,  42, 336]])

In [39]:
arr1 = np.array([-1, 23, 5, -4, -5, 8, 9, 22])
arr1

array([-1, 23,  5, -4, -5,  8,  9, 22])

In [42]:
(arr1>0).sum()

5

In [43]:
bools = np.array([[False ,True, True, False],
                  [False, False,True, False]])
bools

array([[False,  True,  True, False],
       [False, False,  True, False]])

In [44]:
bools.all(axis=0)

array([False, False,  True, False])

In [45]:
bools.any(axis=0)

array([False,  True,  True, False])

In [53]:
arr3 = np.random.randn(10,4) * 3
arr3

array([[-1.86682268, -2.76350582, -2.17864048,  0.66868664],
       [ 0.1539483 , -3.4731584 ,  2.45012081,  1.30082882],
       [ 3.03221084,  5.47462563, -2.99255474,  2.5517733 ],
       [-0.3947328 ,  2.73724246,  0.56463204,  6.50838431],
       [-0.34478461,  6.01109209,  0.08883046,  2.38575947],
       [ 0.35432926, -2.24559465,  1.75490921,  0.45802972],
       [-4.69697188, -1.68762056, -0.09799242, -2.78701861],
       [-1.44771794, -0.10879154,  3.28617018,  2.94278543],
       [-1.76846306,  4.74510028, -1.58620448,  1.37100561],
       [ 2.78990628, -4.70781182, -3.06746093, -1.20848077]])

In [57]:
arr3[(arr3 > 3).any(axis=1)]

array([[ 3.03221084,  5.47462563, -2.99255474,  2.5517733 ],
       [-0.3947328 ,  2.73724246,  0.56463204,  6.50838431],
       [-0.34478461,  6.01109209,  0.08883046,  2.38575947],
       [-1.44771794, -0.10879154,  3.28617018,  2.94278543],
       [-1.76846306,  4.74510028, -1.58620448,  1.37100561]])

In [58]:
arr3[(arr3 > 3).any(axis=1), 2:]

array([[-2.99255474,  2.5517733 ],
       [ 0.56463204,  6.50838431],
       [ 0.08883046,  2.38575947],
       [ 3.28617018,  2.94278543],
       [-1.58620448,  1.37100561]])

In [56]:
arr3[:,(arr3 > 3).any(axis=0)]

array([[-1.86682268, -2.76350582, -2.17864048,  0.66868664],
       [ 0.1539483 , -3.4731584 ,  2.45012081,  1.30082882],
       [ 3.03221084,  5.47462563, -2.99255474,  2.5517733 ],
       [-0.3947328 ,  2.73724246,  0.56463204,  6.50838431],
       [-0.34478461,  6.01109209,  0.08883046,  2.38575947],
       [ 0.35432926, -2.24559465,  1.75490921,  0.45802972],
       [-4.69697188, -1.68762056, -0.09799242, -2.78701861],
       [-1.44771794, -0.10879154,  3.28617018,  2.94278543],
       [-1.76846306,  4.74510028, -1.58620448,  1.37100561],
       [ 2.78990628, -4.70781182, -3.06746093, -1.20848077]])

In [59]:
arr4 = np.random.randn(5,3)
arr4

array([[ 0.22048686, -0.19340111,  0.66915834],
       [-1.64898482, -2.25279725, -1.16683222],
       [ 0.3536071 ,  0.70211017, -0.2745692 ],
       [-0.13914219,  0.10765722, -0.60654513],
       [-0.41706441, -0.01700704, -1.22414528]])

In [61]:
arr4.sort(axis=0)
arr4

array([[-1.64898482, -2.25279725, -1.22414528],
       [-0.41706441, -0.19340111, -1.16683222],
       [-0.13914219, -0.01700704, -0.60654513],
       [ 0.22048686,  0.10765722, -0.2745692 ],
       [ 0.3536071 ,  0.70211017,  0.66915834]])

In [62]:
arr4.sort(axis=1)
arr4

array([[-2.25279725, -1.64898482, -1.22414528],
       [-1.16683222, -0.41706441, -0.19340111],
       [-0.60654513, -0.13914219, -0.01700704],
       [-0.2745692 ,  0.10765722,  0.22048686],
       [ 0.3536071 ,  0.66915834,  0.70211017]])

In [68]:
values = np.array([5,0,1,3,2])
indexer = values.argsort()[::-1]
values

array([5, 0, 1, 3, 2])

In [69]:
indexer

array([0, 3, 4, 2, 1])

In [65]:
values[indexer]

array([0, 1, 2, 3, 5])

In [66]:
arr5 = np.random.randn(3,5)
arr5[0] = values
arr5

array([[ 5.        ,  0.        ,  1.        ,  3.        ,  2.        ],
       [ 1.30671972, -0.44055357, -0.30135028,  0.49879149, -0.82399104],
       [ 1.32056584,  0.50796479, -0.65343768,  0.18697951, -0.39172525]])

In [70]:
arr5[:, arr5[0].argsort()[::-1]]

array([[ 5.        ,  3.        ,  2.        ,  1.        ,  0.        ],
       [ 1.30671972,  0.49879149, -0.82399104, -0.30135028, -0.44055357],
       [ 1.32056584,  0.18697951, -0.39172525, -0.65343768,  0.50796479]])

In [71]:
arr6 = np.array(['bob','joe','will','bob','joe','joe','will'])

array(['bob', 'joe', 'will', 'bob', 'joe', 'joe', 'will'], dtype='<U4')

In [72]:
np.unique(arr6)

array(['bob', 'joe', 'will'], dtype='<U4')

In [73]:
arr7 = [2,4,2,6,2,2,7,5,4,1,4,8,6,7]
arr7

[2, 4, 2, 6, 2, 2, 7, 5, 4, 1, 4, 8, 6, 7]

In [74]:
np.unique(arr7)

array([1, 2, 4, 5, 6, 7, 8])

In [75]:
arr8 = np.array([1,2,3,4])
arr9 = np.array([3,4,5,6])
np.union1d(arr8, arr9)

array([1, 2, 3, 4, 5, 6])

In [76]:
np.intersect1d(arr8, arr9)

array([3, 4])

In [77]:
np.setdiff1d(arr8, arr9)

array([1, 2])

In [78]:
arr10 = np.arange(10)
arr10

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [80]:
np.random.shuffle(arr10)
arr10

array([5, 1, 2, 4, 3, 9, 6, 7, 8, 0])

In [81]:
arr11 = np.arange(10)
arr11

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [82]:
np.random.permutation(arr11)

array([2, 8, 3, 5, 9, 7, 4, 1, 6, 0])

In [83]:
arr11

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [84]:
arr1 =  np.arange(1,7).reshape(2,3)
arr2 = np.arange(7,13).reshape(2,3)
arr1

array([[1, 2, 3],
       [4, 5, 6]])

In [85]:
arr2

array([[ 7,  8,  9],
       [10, 11, 12]])

In [86]:
np.concatenate([arr1, arr2], axis=0)

array([[ 1,  2,  3],
       [ 4,  5,  6],
       [ 7,  8,  9],
       [10, 11, 12]])

In [87]:
np.concatenate([arr1, arr2], axis=1)

array([[ 1,  2,  3,  7,  8,  9],
       [ 4,  5,  6, 10, 11, 12]])

In [88]:
np.vstack([arr1, arr2])

array([[ 1,  2,  3],
       [ 4,  5,  6],
       [ 7,  8,  9],
       [10, 11, 12]])

In [89]:
np.hstack([arr1, arr2])

array([[ 1,  2,  3,  7,  8,  9],
       [ 4,  5,  6, 10, 11, 12]])

In [90]:
arr3 = np.arange(6)
arr4 = np.arange(6).reshape(3,2)
arr5 = np.random.randn(3,2)
arr3

array([0, 1, 2, 3, 4, 5])

In [91]:
arr4

array([[0, 1],
       [2, 3],
       [4, 5]])

In [92]:
arr5

array([[ 0.06581234, -0.55307189],
       [ 1.72006293, -0.37221113],
       [ 1.07188107, -0.38245062]])

In [93]:
np.r_[arr4, arr5]

array([[ 0.        ,  1.        ],
       [ 2.        ,  3.        ],
       [ 4.        ,  5.        ],
       [ 0.06581234, -0.55307189],
       [ 1.72006293, -0.37221113],
       [ 1.07188107, -0.38245062]])

In [94]:
np.c_[arr4, arr5]

array([[ 0.        ,  1.        ,  0.06581234, -0.55307189],
       [ 2.        ,  3.        ,  1.72006293, -0.37221113],
       [ 4.        ,  5.        ,  1.07188107, -0.38245062]])

In [95]:
np.c_[np.r_[arr4, arr5], arr3]

array([[ 0.        ,  1.        ,  0.        ],
       [ 2.        ,  3.        ,  1.        ],
       [ 4.        ,  5.        ,  2.        ],
       [ 0.06581234, -0.55307189,  3.        ],
       [ 1.72006293, -0.37221113,  4.        ],
       [ 1.07188107, -0.38245062,  5.        ]])

In [96]:
import pandas as pd

In [97]:
sdata1 = pd.Series([4,7,-5,2])
sdata1

0    4
1    7
2   -5
3    2
dtype: int64

In [98]:
sdata1.index

RangeIndex(start=0, stop=4, step=1)

In [99]:
sdata1.values

array([ 4,  7, -5,  2])

In [100]:
type(sdata1)

pandas.core.series.Series

In [101]:
sdata2 = pd.Series([4,7,-5,2], index=['d','a','b','a'])
sdata2

d    4
a    7
b   -5
a    2
dtype: int64

In [104]:
sdata2['d']

4

In [105]:
sdata2['a']

a    7
a    2
dtype: int64

In [106]:
sdata2[['b','d']]

b   -5
d    4
dtype: int64

In [107]:
sdata2['d'] = 2000
sdata2

d    2000
a       7
b      -5
a       2
dtype: int64

In [108]:
sdata2 > 3

d     True
a     True
b    False
a    False
dtype: bool

In [109]:
sdata2[sdata2>3]

d    2000
a       7
dtype: int64

In [111]:
np.square(sdata2)

d    4000000
a         49
b         25
a          4
dtype: int64

In [112]:
sdata2 * 3

d    6000
a      21
b     -15
a       6
dtype: int64

In [113]:
ddata = {'seoul':7800, 'busan':5000, 'incheon':4500, 'suwon':3800}
ddata

{'seoul': 7800, 'busan': 5000, 'incheon': 4500, 'suwon': 3800}

In [114]:
sdata3 = pd.Series(ddata)
sdata3

seoul      7800
busan      5000
incheon    4500
suwon      3800
dtype: int64

In [115]:
frame1 = pd.DataFrame([[1,2,3],[4,5,6]])
frame1

   0  1  2
0  1  2  3
1  4  5  6

In [116]:
frame2 = pd.DataFrame([[1,2,3],[4,5,6]],
                     index=['one','two'],
                     columns=['first','second','third'])
frame2

     first  second  third
one      1       2      3
two      4       5      6

In [118]:
ldata1 = [('kim',188, 30),('lee',170,20),('choi',160, 50),('oh',165, 40)]
frame3 = pd.DataFrame(ldata1,
                     columns=['name','height','age'])
frame3

   name  height  age
0   kim     188   30
1   lee     170   20
2  choi     160   50
3    oh     165   40

In [119]:
ddata2 = {'state':['seoul','busan','incheon','daegu','suwon'],
         'year':[2012,2015,2017,2019,2020],
         'pop':[4.5,3.8,3.5,3.0,2.8]}
ddata2

{'state': ['seoul', 'busan', 'incheon', 'daegu', 'suwon'],
 'year': [2012, 2015, 2017, 2019, 2020],
 'pop': [4.5, 3.8, 3.5, 3.0, 2.8]}

In [120]:
frame3 = pd.DataFrame(ddata2)
frame3

     state  year  pop
0    seoul  2012  4.5
1    busan  2015  3.8
2  incheon  2017  3.5
3    daegu  2019  3.0
4    suwon  2020  2.8

In [121]:
frame4 = pd.DataFrame(ddata2,
                     columns=['year','pop','state'],
                     index=['one','two','three','four','five'])
frame4

       year  pop    state
one    2012  4.5    seoul
two    2015  3.8    busan
three  2017  3.5  incheon
four   2019  3.0    daegu
five   2020  2.8    suwon

In [122]:
frame4['state']

one        seoul
two        busan
three    incheon
four       daegu
five       suwon
Name: state, dtype: object

In [123]:
frame4.state

one        seoul
two        busan
three    incheon
four       daegu
five       suwon
Name: state, dtype: object

In [125]:
frame4.loc['two']

year      2015
pop        3.8
state    busan
Name: two, dtype: object

In [126]:
frame4['year']['three']

2017

In [127]:
frame4.loc['three']['year']

2017

In [129]:
frame4.index.name = 'id'
frame4.columns.name = 'values'
frame4

values  year  pop    state
id
one     2012  4.5    seoul
two     2015  3.8    busan
three   2017  3.5  incheon
four    2019  3.0    daegu
five    2020  2.8    suwon

In [130]:
sdata1 = pd.Series([4,7,-2,3], index=list('dabc'))
sdata1

d    4
a    7
b   -2
c    3
dtype: int64

In [131]:
sdata2 = sdata1.reindex(['a','b','c','d','e'])
sdata2

a    7.0
b   -2.0
c    3.0
d    4.0
e    NaN
dtype: float64

In [132]:
sdata3 = sdata1.reindex(['a','b','c','d','e'], fill_value=0)
sdata3

a    7
b   -2
c    3
d    4
e    0
dtype: int64

In [133]:
sdata4 = pd.Series(['red','green','blue'], index=[0,2,4])
sdata4

0      red
2    green
4     blue
dtype: object

In [135]:
sdata5 = sdata4.reindex(np.arange(6), method='ffill')
sdata5

0      red
1      red
2    green
3    green
4     blue
5     blue
dtype: object

In [136]:
frame1 = pd.DataFrame(np.arange(9).reshape(3,3),
                     index=list('acd'),
                     columns=['seoul','busan','incheon'])
frame1

   seoul  busan  incheon
a      0      1        2
c      3      4        5
d      6      7        8

In [138]:
frame2 = frame1.reindex(['a','b','c','d'], fill_value=0)
frame2

   seoul  busan  incheon
a      0      1        2
b      0      0        0
c      3      4        5
d      6      7        8

In [139]:
frame1.reindex(columns=['incheon','seoul','busan'])

   incheon  seoul  busan
a        2      0      1
c        5      3      4
d        8      6      7

In [146]:
sdata1 = pd.Series(np.arange(5), index=list('abcde'))
sdata1

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [147]:
sdata1.drop(['c','d'])

a    0
b    1
e    4
dtype: int64

In [142]:
sdata1

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [143]:
sdata1.drop('c', inplace=True)

In [144]:
sdata1

a    0
b    1
d    3
e    4
dtype: int64

In [148]:
frame1 = pd.DataFrame(np.arange(9).reshape(3,3),
                     index=['ohio','colorado','texas'],
                     columns=['one','two','three'])
frame1

          one  two  three
ohio        0    1      2
colorado    3    4      5
texas       6    7      8

In [149]:
frame1.drop('ohio')

          one  two  three
colorado    3    4      5
texas       6    7      8

In [150]:
frame1.drop(['two'], axis='columns')

          one  three
ohio        0      2
colorado    3      5
texas       6      8

In [151]:
sdata2 = pd.Series([4,8,1,3,9], index=list('abcde'))
sdata2

a    4
b    8
c    1
d    3
e    9
dtype: int64

In [152]:
sdata2['c']

1

In [153]:
sdata2[2]

1

In [154]:
sdata2[1:3]

b    8
c    1
dtype: int64

In [155]:
sdata2['b':'d']

b    8
c    1
d    3
dtype: int64

In [156]:
frame2 = pd.DataFrame(np.arange(16).reshape(4,4),
                     index=['ohio','colorado','texas','utah'],
                     columns=['one','two','three','four'])
frame2

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
texas       8    9     10    11
utah       12   13     14    15

In [158]:
frame2.iloc[2, [3,1]]

four    11
two      9
Name: texas, dtype: int64

In [160]:
frame2.iloc[:, :3]

          one  two  three
ohio        0    1      2
colorado    4    5      6
texas       8    9     10
utah       12   13     14

In [162]:
frame2.loc['ohio':'texas']

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
texas       8    9     10    11

In [163]:
frame3 = pd.DataFrame(np.arange(12).reshape(3,4),
                     columns=list('abcd'))
frame4 = pd.DataFrame(np.arange(20).reshape(4,5),
                     columns=list('abcde'))
frame3

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [164]:
frame4

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [165]:
frame3 + frame4

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [166]:
frame3.add(frame4, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [167]:
frame2

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
texas       8    9     10    11
utah       12   13     14    15

In [169]:
frame2[frame2.four > 10]

       one  two  three  four
texas    8    9     10    11
utah    12   13     14    15

In [170]:
frame1 = pd.DataFrame(np.random.randn(4,3),
                     index=['seoul','busan','incheon','suwon'],
                     columns=list('bde'))
frame1

                b         d         e
seoul    2.520692 -1.234738 -0.479525
busan    2.047217 -1.287601  0.572398
incheon -0.730034  1.436791 -0.624245
suwon   -0.832461 -0.635728 -0.458300

In [171]:
f1 = lambda x : x.max() - x.min()
frame1.apply(f1, axis=0)

b    3.353153
d    2.724392
e    1.196644
dtype: float64

In [172]:
frame1.apply(f1, axis=1)

seoul      3.755430
busan      3.334818
incheon    2.166825
suwon      0.374161
dtype: float64

In [173]:
def f2(x):
    return pd.Series([x.min(), x.max()], index=['min','max'])
frame1.apply(f2, axis=0)

            b         d         e
min -0.832461 -1.287601 -0.624245
max  2.520692  1.436791  0.572398

In [174]:
f3 = lambda x : '%.2f' % x
frame1.applymap(f3)

             b      d      e
seoul     2.52  -1.23  -0.48
busan     2.05  -1.29   0.57
incheon  -0.73   1.44  -0.62
suwon    -0.83  -0.64  -0.46

In [176]:
frame1['e'].map(f3)

seoul      -0.48
busan       0.57
incheon    -0.62
suwon      -0.46
Name: e, dtype: object

In [177]:
sdata1 = pd.Series(np.arange(5), index=list('daecb'))
sdata1

d    0
a    1
e    2
c    3
b    4
dtype: int64

In [181]:
sdata1.sort_index()

a    1
b    4
c    3
d    0
e    2
dtype: int64

In [182]:
frame1 = pd.DataFrame(np.arange(8).reshape(2,4),
                      index=['three','one'],
                      columns=list('dabc'))
frame1

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [183]:
frame1.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [185]:
frame1.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [186]:
sdata2 = pd.Series([7,2,1,5])
sdata2

0    7
1    2
2    1
3    5
dtype: int64

In [187]:
sdata2.sort_values()

2    1
1    2
3    5
0    7
dtype: int64

In [188]:
frame2 = pd.DataFrame({'b':[4,7,-3,2],
                       'a':[0,1,0,1]})
frame2

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [191]:
frame2.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [192]:
frame2.sort_values(by='a')

   b  a
0  4  0
2 -3  0
1  7  1
3  2  1

In [194]:
frame2.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [195]:
frame2.sort_values(by=['a','b'], ascending=[False, True])

   b  a
3  2  1
1  7  1
2 -3  0
0  4  0

In [197]:
frame2 = pd.DataFrame(np.random.randn(1000,3),
                     columns=['first','second','third'])
frame2

        first    second     third
0   -0.437160 -0.578580  0.195434
1    0.499651  0.461841  0.323031
2    0.372358 -1.243809 -0.081712
3    0.789519 -1.584001  0.690353
4   -0.521371  3.108665 -1.253792
..        ...       ...       ...
995 -0.769071  0.807063 -1.186676
996 -0.500489 -2.151639  0.572039
997  0.470175 -0.076565 -0.515851
998 -1.620502  0.632755  0.584840
999  0.172637  1.639444  1.449070

[1000 rows x 3 columns]

In [198]:
frame2.mean()

first    -0.020216
second    0.046967
third    -0.014385
dtype: float64

In [200]:
frame2.sum()

first    -20.216011
second    46.966871
third    -14.384995
dtype: float64

In [201]:
frame2.std()

first     0.996207
second    0.980907
third     0.971882
dtype: float64

In [202]:
frame2.describe()

             first       second        third
count  1000.000000  1000.000000  1000.000000
mean     -0.020216     0.046967    -0.014385
std       0.996207     0.980907     0.971882
min      -3.380646    -2.810658    -2.701379
25%      -0.686017    -0.587597    -0.704361
50%      -0.011064     0.007345    -0.003869
75%       0.675871     0.696384     0.647143
max       3.254193     3.403968     2.907840

In [203]:
frame2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   first   1000 non-null   float64
 1   second  1000 non-null   float64
 2   third   1000 non-null   float64
dtypes: float64(3)
memory usage: 23.6 KB

In [205]:
frame2.head(10)

      first    second     third
0 -0.437160 -0.578580  0.195434
1  0.499651  0.461841  0.323031
2  0.372358 -1.243809 -0.081712
3  0.789519 -1.584001  0.690353
4 -0.521371  3.108665 -1.253792
5  1.892025  0.223578  2.566607
6  0.227158  0.206724 -0.085168
7  1.740296 -0.209615 -0.671665
8  0.150276  1.566916  1.198736
9  1.277399  0.552228 -0.765424

In [206]:
frame2.tail(15)

        first    second     third
985  1.412768  1.900133  0.382085
986 -0.247754 -0.208414 -1.160474
987  1.407466  0.634955 -0.795986
988 -1.014254  1.190901 -1.101777
989 -1.227922 -1.701305 -0.447077
990  0.309468  1.692071 -0.628639
991 -0.561150  0.169408  0.086095
992 -0.153176 -0.229693  1.649969
993 -0.301881 -0.531882  1.655353
994 -0.295957 -0.507890  0.490328
995 -0.769071  0.807063 -1.186676
996 -0.500489 -2.151639  0.572039
997  0.470175 -0.076565 -0.515851
998 -1.620502  0.632755  0.584840
999  0.172637  1.639444  1.449070

In [215]:
frame3 = pd.DataFrame([[95,80,50],[77,78,92]],
                     columns=['kor','eng','math'])
frame3

   kor  eng  math
0   95   80    50
1   77   78    92

In [216]:
frame3['kor'].corr(frame3['eng'])

1.0

In [217]:
frame3['kor'].corr(frame3['math'])

-1.0

In [218]:
frame3.corr()

      kor  eng  math
kor   1.0  1.0  -1.0
eng   1.0  1.0  -1.0
math -1.0 -1.0   1.0

In [219]:
frame3.cov()

        kor   eng   math
kor   162.0  18.0 -378.0
eng    18.0   2.0  -42.0
math -378.0 -42.0  882.0

In [220]:
sdata1 = pd.Series([1, np.nan, 3.5, 4.2, np.nan, 8])
sdata1

0    1.0
1    NaN
2    3.5
3    4.2
4    NaN
5    8.0
dtype: float64

In [222]:
sdata1

0    1.0
1    NaN
2    3.5
3    4.2
4    NaN
5    8.0
dtype: float64

In [221]:
sdata1.notnull()

0     True
1    False
2     True
3     True
4    False
5     True
dtype: bool

In [223]:
sdata1[sdata1.notnull()]

0    1.0
2    3.5
3    4.2
5    8.0
dtype: float64

In [224]:
sdata1.dropna()

0    1.0
2    3.5
3    4.2
5    8.0
dtype: float64

In [225]:
frame1 = pd.DataFrame(np.random.randn(7,3),
                     columns=['one','two','three'])
frame1.iloc[:4, 1] = np.nan
frame1.iloc[:2, 2] = np.nan
frame1

        one       two     three
0 -1.324406       NaN       NaN
1 -0.091809       NaN       NaN
2  0.156314       NaN -1.226636
3 -1.973643       NaN  0.481677
4  1.032769 -0.290895  0.295419
5  0.159977 -0.693202  1.449041
6 -0.015932 -1.054160  1.063912

In [226]:
frame1.fillna(0)

        one       two     three
0 -1.324406  0.000000  0.000000
1 -0.091809  0.000000  0.000000
2  0.156314  0.000000 -1.226636
3 -1.973643  0.000000  0.481677
4  1.032769 -0.290895  0.295419
5  0.159977 -0.693202  1.449041
6 -0.015932 -1.054160  1.063912

In [227]:
frame1.fillna({'two':-10, 'three':10})

        one        two      three
0 -1.324406 -10.000000  10.000000
1 -0.091809 -10.000000  10.000000
2  0.156314 -10.000000  -1.226636
3 -1.973643 -10.000000   0.481677
4  1.032769  -0.290895   0.295419
5  0.159977  -0.693202   1.449041
6 -0.015932  -1.054160   1.063912

In [228]:
frame1.mean()

one     -0.293819
two     -0.679419
three    0.412683
dtype: float64

In [229]:
frame1.fillna(frame1.mean())

        one       two     three
0 -1.324406 -0.679419  0.412683
1 -0.091809 -0.679419  0.412683
2  0.156314 -0.679419 -1.226636
3 -1.973643 -0.679419  0.481677
4  1.032769 -0.290895  0.295419
5  0.159977 -0.693202  1.449041
6 -0.015932 -1.054160  1.063912

In [230]:
frame1.fillna(method='bfill')

        one       two     three
0 -1.324406 -0.290895 -1.226636
1 -0.091809 -0.290895 -1.226636
2  0.156314 -0.290895 -1.226636
3 -1.973643 -0.290895  0.481677
4  1.032769 -0.290895  0.295419
5  0.159977 -0.693202  1.449041
6 -0.015932 -1.054160  1.063912

In [232]:
frame2 = pd.DataFrame([[32,78],[88,99]],
                      columns=['seoul','busan'],
                      index=['first','second'])
frame2

        seoul  busan
first      32     78
second     88     99

In [234]:
frame2['incheon'] = pd.Series([83,71], index=['first','second'])
frame2

        seoul  busan  incheon
first      32     78       83
second     88     99       71

In [235]:
frame2.loc['third'] = pd.Series([74,63,91], index=['seoul','busan','incheon'])
frame2

        seoul  busan  incheon
first      32     78       83
second     88     99       71
third      74     63       91

In [237]:
frame2.loc['second']

seoul      88
busan      99
incheon    71
Name: second, dtype: int64

In [236]:
frame3 = pd.DataFrame({'a':np.arange(7),
                       'b':np.arange(7,0,-1),
                       'c':['one','one','one','two','two','two','two'],
                       'd':[0,1,2,0,1,2,3]})
frame3

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [239]:
frame4 = frame3.set_index(['c'])
frame4

     a  b  d
c
one  0  7  0
one  1  6  1
one  2  5  2
two  3  4  0
two  4  3  1
two  5  2  2
two  6  1  3

In [240]:
frame3.set_index(['c','d'])

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [242]:
frame4.reset_index()

     c  a  b  d
0  one  0  7  0
1  one  1  6  1
2  one  2  5  2
3  two  3  4  0
4  two  4  3  1
5  two  5  2  2
6  two  6  1  3